#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

google_storage_bucket_object.blockchain_etl_dataflow: Refreshing state... [id=prod-im-data-imx-resource-dataflow-templates/blockchain-etl-dataflow/metadata.json]
google_dataflow_flex_template_job.flex_template_job: Refreshing state... [id=2023-09-15_00_22_02-12136321830527052445]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_dataflow_flex_template_job.flex_template_job must be replaced
-/+ resource "google_dataflow_flex_template_job" "flex_template_job" {
      ~ additional_experiments       = [] -> (known after apply)
      ~ id                           = "2023-09-15_00_22_02-12136321830527052445" -> (known after apply)
      ~ job_id                       = "2023-09-15_00_22_02-12136321830527052445" -> (known after apply)
      - labels                       = {} -> null
      - machine_type                 = "n1-standard-1" -> null
      - max_workers                  = 0 -> null
      ~ name                         = "zkevm-imtbl-testnet-etl-dataflow-20230915-072202" # forces replacement -> (known after apply) # forces replacement
      - num_workers                  = 0 -> null
      ~ service_account_email        = "692943280739-compute@developer.gserviceaccount.com" -> (known after apply)
      ~ staging_location             = "gs://dataflow-staging-us-central1-692943280739/staging" -> (known after apply)
      ~ state                        = "JOB_STATE_RUNNING" -> (known after apply)
      ~ temp_location                = "gs://prod-im-data-imx-resource/ethereum-etl/temp" -> (known after apply)
      ~ type                         = "JOB_TYPE_STREAMING" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # google_dataflow_flex_template_job.zkevm_imtbl_mainnet_job will be created
  + resource "google_dataflow_flex_template_job" "zkevm_imtbl_mainnet_job" {
      + additional_experiments       = (known after apply)
      + container_spec_gcs_path      = "gs://prod-im-data-imx-resource/dataflow-templates/blockchain-etl-dataflow/metadata.json"
      + id                           = (known after apply)
      + job_id                       = (known after apply)
      + name                         = (known after apply)
      + on_delete                    = "drain"
      + parameters                   = {
          + "allowedTimestampSkewSeconds" = "5184000"
          + "chainConfigFile"             = "/template/blockchain_zkevm_imtbl_mainnet_prod.json"
          + "diskSizeGb"                  = "30"
          + "enableStreamingEngine"       = "true"
          + "gcpTempLocation"             = "gs://prod-im-data-imx-resource/ethereum-etl/zkevm-imtbl-mainnet-streaming/temp"
          + "maxNumWorkers"               = "1"
          + "project"                     = "prod-im-data"
          + "region"                      = "us-central1"
          + "runner"                      = "DataflowRunner"
          + "tempLocation"                = "gs://prod-im-data-imx-resource/ethereum-etl/zkevm-imtbl-mainnet-streaming/temp"
          + "workerMachineType"           = "n1-standard-1"
          + "zone"                        = "us-central1-a"
        }
      + project                      = "prod-im-data"
      + region                       = "us-central1"
      + service_account_email        = (known after apply)
      + skip_wait_on_job_termination = true
      + staging_location             = (known after apply)
      + state                        = (known after apply)
      + temp_location                = (known after apply)
      + type                         = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @roopak-immutable, Action: `pull_request`, Workflow: `Deploy blockchain etl datafow into GCP`*